IDEA Open Model
CheckResSummary Class
Compatible with IDEA StatiCa 20.1
 Check summary
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CheckResSummary
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[SerializableAttribute]
public class CheckResSummary
<SerializableAttribute>
Public Class CheckResSummary
The CheckResSummary type exposes the following members.
Constructors
Name | Description
CheckResSummary
Initializes a new instance of the CheckResSummary class
Top
Properties
Name | Description
CheckStatus
 Status of check
CheckValue
 Check value
LoadCaseId |  Obsolete.
 Id of Load Case
Name
 Name
UnityCheckMessage
 Detail message about overall check
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace